app/views/components/show.html.erb

<%= @component.unitUse_id %>
<%= @component.modulus.ids %>
---
SELECT "modulus"."id" FROM "modulus" INNER JOIN "components_modulus" ON "modulus"."id" = "components_modulus"."modulu_id" WHERE "components_modulus"."component_id" = ?  [["component_id", 3]]