app/views/clients/index.html.erb

              <td><%= client.id %></td>
              <td><%= client.firstNameClient %></td>
---
SELECT "clients".* FROM "clients"