app/views/project_modular_houses/edit.html.erb

    <%= f.label :client_id, 'Client :'%><br />
    <%= f.collection_select :client_id, Client.all, :id, :clientName%>
---
SELECT "clients".* FROM "clients"