app/views/project_modular_houses/new.html.erb

    <%= f.label :client_id, 'Client : ' %><br />
    <%= f.collection_select :client_id, Client.all, :id, :clientName%>
---
SELECT "clients".* FROM "clients"

    <%= f.label :user_id, 'Commercial :'%><br />
    <%= f.collection_select :user_id, User.all, :id, :lastname%>
---
SELECT "users".* FROM "users"