app/controllers/clients_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "clients" SET "firstNameClient" = ? WHERE "clients"."id" = ?  [["firstNameClient", "Romain2"], ["id", 1]]
---
    def update
        @client = Client.find(params[:id])
        @client.update(client_params)

INSERT INTO "clients" ("clientName", "firstNameClient", "streetNumber", "streetName", "pc", "cityName") VALUES (?, ?, ?, ?, ?, ?)  [["clientName", "LOCQUET"], ["firstNameClient", "Romain"], ["streetNumber", 1], ["streetName", "Rue des pervenches"], ["pc", 72700], ["cityName", "Allonnes"]]
---
    def create
        @client = Client.create(client_params)