app/controllers/components_controller.rb

SELECT "components".* FROM "components"
---
  def index
    @components = Component.all

SELECT  "components".* FROM "components" WHERE "components"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_component
    @component = Component.find(params[:id])