app/controllers/project_modular_houses_controller.rb

  def index
    @projets = ProjectModularHouse.includes(:client, :user, :scale_modular_house).all
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (1, 3)

  def update
    @projet = ProjectModularHouse.find(params[:id])
    @projet.update(projet_params)
---
UPDATE "project_modular_houses" SET "user_id" = ? WHERE "project_modular_houses"."id" = ?  [["user_id", 7], ["id", 4]]

  def destroy
    @projet = ProjectModularHouse.find(params[:id])
    @projet.destroy
---
DELETE FROM "project_modular_houses" WHERE "project_modular_houses"."id" = ?  [["id", 2]]

  def create
    @projet = ProjectModularHouse.create(projet_params)
---
INSERT INTO "project_modular_houses" ("projectName", "client_id") VALUES (?, ?)  [["projectName", "testProjet"], ["client_id", 1]]