app/controllers/providers_controller.rb

SELECT "providers".* FROM "providers"
---
  def index
    @providers = Provider.all

SELECT  "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @provider = Provider.find(params[:id])

INSERT INTO "providers" ("providerName", "streetNumber", "streetName", "pc", "cityName", "phonenumber", "email") VALUES (?, ?, ?, ?, ?, ?, ?)  [["providerName", "Valeo"], ["streetNumber", 46], ["streetName", "Rue cugnot"], ["pc", 53000], ["cityName", "Laval"], ["phonenumber", "0243455678"], ["email", "valeo@valeo.com"]]
---
  def create
    @provider = Provider.create(provider_params)